Repository: nikitazuevblago/Video-to-post
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: [INFO] The last video of {yt_author} was SHORTS(too short)
ru: [INFO] Последнее видео {yt_author} было КОРОТКИМ (слишком короткое)

source: [INFO] The last video of {yt_author} was PODCAST(too long)
ru: [INFO] Последнее видео {yt_author} было ПОДКАСТОМ (слишком длинное)

source: [INFO] Trouble with the creator {yt_author}; Requests.get(url) response -> {response}
ru: [INFO] Проблема с создателем {yt_author}; Requests.get(url) ответ -> {response}

source: [INFO] Trouble with the creator {yt_author}; Exception: {e} (AIOTUBE)
ru: [INFO] Проблема с создателем {yt_author}; Исключение: {e} (AIOTUBE)

source: [ERROR]: video url did not pass VideoToPost {video_url}
ru: [ERROR]: url видео не прошел VideoToPost {video_url}

source: {'*'*15}Removing creators from which we couldn't retrieve the video{'*'*15}
ru: {'*'*15}Удаление создателей, от которых не удалось получить видео{'*'*15}

source: [INFO] There are 0 tracked YouTube channels! Auto post suggesting doesn't work...
ru: [INFO] Отслеживаемых каналов YouTube нет! Автоматическое предложение постов не работает...

source: [INFO] There are 0 projects! Auto post suggesting doesn't work...
ru: [INFO] Проектов нет! Автоматическое предложение постов не работает...

source: Enter the command with link without nothing else! Example: /video_to_post https://youtu.be/eH_TOrddnZ0?si=pwpELPdAcO5XOzG5
ru: Введите команду со ссылкой без ничего лишнего! Пример: /video_to_post https://youtu.be/eH_TOrddnZ0?si=pwpELPdAcO5XOzG5

source: Select the Telegram channel where you want to send the post
ru: Выберите Telegram-канал, куда хотите отправить пост

source: [ERROR] First create the project with /create_project!
ru: [ERROR] Сначала создайте проект с помощью /create_project!

source: [ERROR] You are NOT the admin of this group!
ru: [ERROR] Вы НЕ администратор этой группы!

source: [ERROR] This command executes only in admin group!
ru: [ERROR] Эта команда выполняется только в админ-группе!

source: Pick which channel's config to change
ru: Выберите конфигурацию канала для изменения

source: Admin group id P.s. Can be accessed with /get_group_id, using bot in created tg group ONLY FOR ADMINS
ru: ID админ-группы P.s. Доступно через /get_group_id, используя бота в созданной tg-группе ТОЛЬКО ДЛЯ АДМИНИСТРАТОРОВ

source: TG channel id (posts destination) P.s. Can be accessed with /get_group_id, using bot in created tg channel for viewers
ru: ID канала TG (место назначения постов) P.s. Доступно через /get_group_id, используя бота в созданном tg-канале для зрителей

source: [INFO] The project {channel_name} has been created!...
ru: [INFO] Проект {channel_name} был создан!...

source: The new project HASN'T been created! P.s. Frequent errors - 1. Project already exists (/check_projects) 2. Letters in 'Admin group id' or 'TG channel id'
ru: Новый проект НЕ был создан! P.s. Частые ошибки - 1. Проект уже существует (/check_projects) 2. Буквы в 'ID админ-группы' или 'ID канала TG'

source: ID of this group: {chat_id}
ru: ID этой группы: {chat_id}

source: This command can only be used in a group or supergroup.
ru: Эту команду можно использовать только в группе или супергруппе.

source: You have {balance} tokens
ru: У вас {balance} токенов

source: {user_name} added {amount} tokens to the balance! Current balance is {balance} tokens
ru: {user_name} добавили {amount} токенов на баланс! Текущий баланс составляет {balance} токенов

source: This admin group is linked to these projects {project_names}
ru: Эта админ-группа связана с этими проектами {project_names}

source: Pick to which TG channel attach new YT channels
ru: Выберите, к какому каналу TG прикрепить новые каналы YouTube

source: No TG channels attached to admin group with id {chat_id}!
ru: Нет каналов TG, прикрепленных к админ-группе с id {chat_id}!

source: {user_name} approved the post.
ru: {user_name} одобрил пост.

source: {user_name} disapproved the post.
ru: {user_name} не одобрил пост.

source: Выбраный язык: Русский
ru: Выбранный язык: Русский

source: Chosen language: English
ru: Выбранный язык: Английский

source: Linking tracking of new YouTube channels to '{chosen_tg_channel_name}'
ru: Привязка отслеживания новых каналов YouTube к '{chosen_tg_channel_name}'

source: Enter the channels without @ separated by commas (no need for commas for 1 channel) For example: ImanGadzhi,childishgambino
ru: Введите каналы без @, разделенные запятыми (без запятых для одного канала) Например: ImanGadzhi,childishgambino

source: Separate channels by comma! Try /new_channels again.
ru: Разделите каналы запятыми! Попробуйте /new_channels снова.

source: The YT channels {new_YT_channels} have been linked to {chosen_tg_channel_name}!
ru: Каналы YouTube {new_YT_channels} были связаны с {chosen_tg_channel_name}!

source: The YT channels {new_YT_channels} have NOT been linked to {chosen_tg_channel_name}!
ru: Каналы YouTube {new_YT_channels} НЕ были связаны с {chosen_tg_channel_name}!

source: Linking the new config to {tg_channel_name}
ru: Привязка новой конфигурации к {tg_channel_name}

source: Choose the language of posts
ru: Выберите язык постов

source: Choose whether to reference the YT author
ru: Выберите, указывать ли автора YouTube

source: Include the YT banner? P.s. It will serve as the post's image
ru: Включить баннер YouTube? P.s. Он будет служить изображением поста

source: Config has been changed!
ru: Конфигурация была изменена!

source: Config has NOT been changed!
ru: Конфигурация НЕ была изменена!

source: Hello! I am a bot created for converting YouTube videos to Telegram posts!
ru: Привет! Я бот, созданный для конвертации видео с YouTube в посты в Telegram!

source: [INFO] Converting this video into a Telegram post will cost {post_cost} tokens. Do you agree?
ru: [INFO] Конвертация этого видео в TG пост будет стоить {post_cost} токенов. Вы согласны?

source: [INFO] Converting this video {video_url} into a Telegram post will cost {post_cost} tokens. Do you agree?
ru: [INFO] Конвертация этого видео {video_url} в TG пост будет стоить {post_cost} токенов. Вы согласны?

source: [ERROR] - You don't have enough tokens! Your balance is {user_balance}
ru: [ERROR] - У вас недостаточно токенов! Ваш баланс составляет {user_balance}

source: Top up the balance
ru: Пополнение баланса

source: The action is canceled!
ru: Действие отменено!

source: Enter the amount of tokens after /top_up, no letters, no spaces! Range of allowed sum from 100 to 1000 rub Example: /top_up 100
ru: Введите количество токенов после /top_up, без букв и пробелов! Допустимая сумма пополнения от 100 до 1000 рублей. Пример: /top_up 100

source: *Welcome to VideoToPostBOT\!* 🤖 *Intro* This bot is created to automatically convert videos from YouTube to Telegram posts First, you need to create the project with /create\_project\. By itself the project it's a combination of the admin group and target telegram channel\. Second, you need to add the bot to admin group and telegram channel\. Make the bot admin\. • Admin group \- telegram group with admins where they can accept or decline posts created by AI\. • Target telegram channel \- telegram channel with all accepted posts\. • One admin group can have many linked telegram channels\! Here are the commands you can use: *General Commands:* /set\_language \- Choose the language\. /help \- Get instructions on how to use the bot\. *Channel Management:* /new\_channels \- Track new YouTube channels to get posts automatically\. /post\_config \- Post settings aimed at a certain Telegram channel\. /create\_project \- Project is a combo of admin group and target Telegram channel\. /get\_group\_id \- Add bot to the group to get its ID\. /video\_to\_post \- Manually get the Telegram post from a YouTube video\. *Financial Commands:* /top\_up \- Top up your balance\. /balance \- Check your balance\. /check\_transactions \- Get a table with your previous transactions\. *Project and Group Management:* /check\_projects \- Get linked to admin group Telegram channels\. *Support:* /support \- Contact the creator\. For any further assistance, feel free to reach out to our support team\. Enjoy using VideoToPostBOT\! 😊
ru: *Здравствуй пользователь VideoToPostBOT\!* 🤖 *Вступление* Этот бот создан для автоматического преобразования видео с YouTube в посты в Telegram *Настройка:* Сначала вам нужно создать проект с помощью /create\_project\. Сам по себе проект \- это комбинация админ группы и целевого канала Telegram\. Во\-вторых, вам нужно добавить бота в админ группу и канал Telegram\. Сделайте бота администратором\. • Админ группа \- группа с админами, где они могут принимать или отклонять посты, созданные ИИ\. • Целевой Telegram канал \- канал Telegram со всеми принятыми постами\. • Одна админ группа может иметь много связанных каналов Telegram\! Вот команды, которые вы можете использовать: *Общие комманды:* /set\_language \- Выберите язык\. /help \- Получите инструкции по использованию бота\. *Управление каналом:* /new\_channels \- Отслеживайте новые каналы YouTube, чтобы автоматически получать посты\. /post\_config \- Настройки постов для определенного канала Telegram\. /get\_group\_id \- Добавьте бота в группу, чтобы получить ее ID\. /video\_to\_post \- Вручную получите пост Telegram из видео YouTube\. *Финансовые комманды:* /top\_up \- Пополните баланс\. /balance \- Проверьте свой баланс\. /check\_transactions \- Получите таблицу с вашими предыдущими транзакциями\. *Управление проектами:* /check\_projects \- Проверить проекты привязанные к админ группе\. /create\_project \- Проект \- это комбинация админ группы и целевого канала Telegram\. *Поддержка:* /support \- Связаться с создателем\. Для дальнейшей помощи не стесняйтесь обращаться в нашу службу поддержки\. Наслаждайтесь функционалом VideoToPostBOT\! 😊

source: Hello, I'm @blago7daren! Please contact me if something bad happens.
ru: Привет, я @blago7daren! Пожалуйста пишите, если наткнулись на ошибку.
